{
  "portfolio-title": "Portfolio",
  "home": "Home",
  "services": "Services",
  "portfolio": "Portfolio",
  "contact": "Contact",
  "about": "About",
  "name-introduction": "Hi, I'm",
  "CV-button": "Download CV",
  "My-services": "My Services",
  "Web-Development": "Web Development",
  "Full-Stack-Development": "Full-Stack Development",
  "Mobile-Development": "Mobile Development",
  "texto-paragrafo1": "As a web developer, I offer complete and customized solutions to meet your online needs, from creating institutional websites to complex systems. Combining skills in design, programming and optimization, I always aim to deliver functional, responsive products with a great user experience.",
  "texto-paragrafo2": "As a Full-Stack Developer, I offer complete solutions for web application development, covering both the front-end and the back-end. My approach is geared towards creating robust, scalable systems with an excellent user experience.",
  "texto-paragrafo3": "As a Mobile Developer, I create native and hybrid applications that offer a fluid, intuitive and high-performance experience. My goal is to turn ideas into functional applications, ensuring that the end product is scalable, secure and meets users' needs.",
  "latest-projects": "Latest Projects",
  "Dev-burguer": "Dev; 👨‍💻 Burguer 🍔",
  "texto-paragrafo4": "Website for a burger restaurant.",
  "landing-page-barberdev": "Landing Page - BarberDev; ✂️",
  "texto-paragrafo6": "Complete responsive landing page for the BarberDev website.",
  "dieta-AIapp": "❤️ Dieta.AI app 📲",
  "texto-paragrafo7": "Mobile application for tracking diet and nutrition.",
  "finans-website": "Finans Website 🪙",
  "texto-paragrafo8": "Website for a finance company.",
  "spotify-clone": "Spotify Clone 🎵",
  "texto-paragrafo9": "Clone of the Spotify music streaming service.",
  "mario": "The Super Mario 🍄 Bros.Movie - Website",
  "texto-paragrafo10": "Website for the Super Mario Bros. movie.",
  "national-museum": "National Museum 🏛️",
  "texto-paragrafo11": "Website for the National Museum.",
  "chale-hotel": "Chalé Hotel 🏨",
  "texto-paragrafo12": "Website for a hotel chalet.",
  "read-more-btn": "Read More",
  "contact-me": "Contact Me",
  "send-message": "Send Message",
  "about-me": "About Me",
  "texto-paragrafo-contact-section": "Hello, I'm Diogo. A Software Enginner, with a passion for developing innovative solutions that solve complex problems and enhance user experience. I have solid knowledge in software development, with a focus on:",
  "footer": "Copyright 2025 by </Diogo Ataide Silva>. All rights reserved.",
  "texto-paragrafo-web-development": "As a web developer, I offer complete and customized solutions to meet your online needs,from creating institutional websites to complex systems. Combining skills in design, programming and optimization, I always aim to deliver functional, responsive products with a great user experience. My services include:",
  "what-do-i-do": "What do I do?",
  "what-do-i-do-paragrafo1": "Website and Blog Development: Creation of modern, functional and easy-to-navigate websites, with a focus on responsive design and optimization for different devices.",
  "what-do-i-do-paragrafo2": "E-commerce development: Implementation of complete online stores, with integration of payment systems, stock management and layout customization",
  "what-do-i-do-paragrafo3": "Customized Web Applications: Development of tailor-made systems, such as platforms, CRMs or internal solutions, with specific functionalities for your business.",
  "what-do-i-do-paragrafo4": "Front-End Development: Building interactive and intuitive interfaces using HTML, CSS, JavaScript and modern frameworks, ensuring an engaging user experience.",
  "what-do-i-do-paragrafo5": "Back-End Development: Implementation of servers, APIs and databases, guaranteeing security, scalability and good performance in your applications.",
  "what-do-i-do-paragrafo6": "Web Development Consulting: Technical advice on the best approach for your web project, including choice of technologies and best practices.",
  "what-do-i-do-paragrafo7": "SEO and Performance Optimization: Improving your site's visibility in search engines and speed optimization to ensure better performance and user experience.",
  "what-do-i-do-paragrafo8": "Maintenance and Technical Support: Regular updates, bug fixes, security adjustments and performance monitoring.",
  "main-technologies": "Main Technologies",
  "main-technologies-paragrafo1": "Front-End: HTML5, CSS3, JavaScript (ES6+), React, Bootstrap, Tailwind.",
  "main-technologies-paragrafo2": "Back-End: Node.js, Express, MongoDB, Firebase, RESTful APIs.",
  "main-technologies-paragrafo3": "Database: MySQL, PostgreSQL, MongoDB.",
  "main-technologies-paragrafo4": "Version Control: Git, GitHub..",
  "main-technologies-paragrafo5": "Deployment and Cloud: AWS, Netlify, Vercel, DigitalOcean.",
  "my-work-process": "My Work Process",
  "my-work-process-paragrafo1": "Project Discovery First: I understand the client's needs, the project's objectives and the target audience in order to define a personalized strategy.",
  "my-work-process-paragrafo2": "Design and Prototyping: I develop an initial prototype, ensuring that the design and functionality are in line with the client's expectations.",
  "my-work-process-paragrafo3": "Development and Testing: I build the project with a focus on clean, modular and efficient code. I run tests to ensure that everything works as expected..",
  "my-work-process-paragrafo4": "Delivery and Support: I deploy the application and offer ongoing support to keep the website updated, secure and optimized.",
  "why-choose-me": "Why Choose Me?",
  "why-choose-me-paragrafo1": "Transparent communication and commitment to deadlines.",
  "why-choose-me-paragrafo2": "Responsive Design and User Experience (UX).",
  "why-choose-me-paragrafo3": "Complete Front-End and Back-End Development.",
  "why-choose-me-paragrafo4": "Use of Modern Technologies.",
  "why-choose-me-paragrafo5": "Focus on Performance and SEO.",
  "why-choose-me-paragrafo6": "Security and Maintenance.",
  "main-section-paragrafo1": "As a Full-Stack Developer, I offer complete solutions for web application development, covering both the front-end and the back-end. My approach is geared towards creating robust, scalable systems with an excellent user experience. My services include:",
  "hidden-content-list-item1": "Front-End Development: Creating modern, responsive interfaces using frameworks such as React, Angular or Vue.js. Focus on usability, performance and intuitive design",
  "hidden-content-list-item2": "Back-End Development: Building secure and scalable APIs, integrating with databases (SQL and NoSQL) and configuring servers using Node.js, Django, Express, among others.",
  "hidden-content-list-item3": "Integration of Services and APIs: Connecting applications to third-party APIs, payment services, social authentication, email services, among others.",
  "hidden-content-list-item4": "DevOps and Deployment: Configuring CI/CD pipelines, deploying to cloud servers (AWS, Azure, DigitalOcean), as well as monitoring and maintaining applications.",
  "hidden-content-list-item5": "Database: Creating and optimizing relational (MySQL, PostgreSQL) and non-relational (MongoDB, Firebase) databases.",
  "main-technologies-list-items1": "Front-End: HTML, CSS, JavaScript, React, Angular, Vue.js.",
  "main-technologies-list-items2": "Back-End: Node.js, Express, Django, Flask.",
  "main-technologies-list-items3": "Database: MySQL, PostgreSQL, MongoDB.",
  "main-technologies-list-items4": "DevOps: Docker, Kubernetes, Git, CI/CD.",
  "main-technologies-list-items5": "Cloud Services: AWS, Azure, DigitalOcean.",
  "my-work-process-list-items1": "Project Understanding: I gather the client's requirements and needs to propose the best technological solution.",
  "my-work-process-list-items2": "Design and Prototyping: I develop a functional prototype to ensure that the solution meets expectations.",
  "my-work-process-list-items3": "Development and Testing: I build the code in a modular way and carry out tests to ensure the quality of the software.",
  "my-work-process-list-items4": "Deployment and Support: I deploy the application in a secure environment and offer ongoing support for improvements and updates.",
  "why-choose-me-list-items1": "Transparent communication during all stages of the project.",
  "why-choose-me-list-items2": "Delivery within agreed deadlines.",
  "why-choose-me-list-items3": "Modern, up-to-date technological solutions.",
  "why-choose-me-list-items4": "Complete support, from planning to maintenance."
  
}
