{
  "portfolio-title": "Portfolio",
  "home": "Home",
  "services": "Services",
  "portfolio": "Portfolio",
  "contact": "Contact",
  "about": "About",
  "name-introduction": "Hi, I'm",
  "glitch-software-engineer": "Software Engineer",
  "CV-button": "Download CV",
  "My-services": "My Services",
  "Web-Development": "Web Development",
  "Full-Stack-Development": "Full-Stack Development",
  "Mobile-Development": "Mobile Development",
  "texto-paragrafo1": "As a web developer, I offer complete and customized solutions to meet your online needs, from creating institutional websites to complex systems. Combining skills in design, programming and optimization, I always aim to deliver functional, responsive products with a great user experience.",
  "texto-paragrafo2": "As a Full-Stack Developer, I offer complete solutions for web application development, covering both the front-end and the back-end. My approach is geared towards creating robust, scalable systems with an excellent user experience.",
  "texto-paragrafo3": "As a Mobile Developer, I create native and hybrid applications that offer a fluid, intuitive and high-performance experience. My goal is to turn ideas into functional applications, ensuring that the end product is scalable, secure and meets users' needs.",
  "latest-projects": "Latest Projects",
  "Dev-burguer": "Dev; 👨‍💻 Burguer 🍔",
  "texto-paragrafo4": "Website for a burger restaurant.",
  "landing-page-barberdev": "Landing Page - BarberDev; ✂️",
  "texto-paragrafo6": "Complete responsive landing page for the BarberDev website.",
  "dieta-AIapp": "❤️ Dieta.AI app 📲",
  "texto-paragrafo7": "Mobile application for tracking diet and nutrition.",
  "finans-website": "Finans Website 🪙",
  "texto-paragrafo8": "Website for a finance company.",
  "spotify-clone": "Spotify Clone 🎵",
  "texto-paragrafo9": "Clone of the Spotify music streaming service.",
  "mario": "The Super Mario 🍄 Bros.Movie - Website",
  "texto-paragrafo10": "Website for the Super Mario Bros. movie.",
  "national-museum": "National Museum 🏛️",
  "texto-paragrafo11": "Website for the National Museum.",
  "chale-hotel": "Chalé Hotel 🏨",
  "texto-paragrafo12": "Website for a hotel chalet.",
  "read-more-btn": "Read More",
  "contact-me": "Contact Me",
  "send": "Send",
  "about-me": "About Me",
  "texto-paragrafo-contact-section": "Hello, I'm Diogo. A Software Enginner, with a passion for developing innovative solutions that solve complex problems and enhance user experience. I have solid knowledge in software development, with a focus on:",
  "footer": "Copyright 2025 by </Diogo Ataide Silva>. All rights reserved.",
  "texto-paragrafo-web-development": "As a web developer, I offer complete and customized solutions to meet your online needs,from creating institutional websites to complex systems. Combining skills in design, programming and optimization, I always aim to deliver functional, responsive products with a great user experience. My services include:",
  "what-do-i-do": "What do I do?",
  "what-do-i-do-paragrafo1": "Website and Blog Development: Creation of modern, functional and easy-to-navigate websites, with a focus on responsive design and optimization for different devices.",
  "what-do-i-do-paragrafo2": "E-commerce development: Implementation of complete online stores, with integration of payment systems, stock management and layout customization",
  "what-do-i-do-paragrafo3": "Customized Web Applications: Development of tailor-made systems, such as platforms, CRMs or internal solutions, with specific functionalities for your business.",
  "what-do-i-do-paragrafo4": "Front-End Development: Building interactive and intuitive interfaces using HTML, CSS, JavaScript and modern frameworks, ensuring an engaging user experience.",
  "what-do-i-do-paragrafo5": "Back-End Development: Implementation of servers, APIs and databases, guaranteeing security, scalability and good performance in your applications.",
  "what-do-i-do-paragrafo6": "Web Development Consulting: Technical advice on the best approach for your web project, including choice of technologies and best practices.",
  "what-do-i-do-paragrafo7": "SEO and Performance Optimization: Improving your site's visibility in search engines and speed optimization to ensure better performance and user experience.",
  "what-do-i-do-paragrafo8": "Maintenance and Technical Support: Regular updates, bug fixes, security adjustments and performance monitoring.",
  "main-technologies": "Main Technologies",
  "main-technologies-paragrafo1": "Front-End: HTML5, CSS3, JavaScript (ES6+), React, Bootstrap, Tailwind.",
  "main-technologies-paragrafo2": "Back-End: Node.js, Express, MongoDB, Firebase, RESTful APIs.",
  "main-technologies-paragrafo3": "Database: MySQL, PostgreSQL, MongoDB.",
  "main-technologies-paragrafo4": "Version Control: Git, GitHub..",
  "main-technologies-paragrafo5": "Deployment and Cloud: AWS, Netlify, Vercel, DigitalOcean.",
  "my-work-process": "My Work Process",
  "my-work-process-paragrafo1": "Project Discovery First: I understand the client's needs, the project's objectives and the target audience in order to define a personalized strategy.",
  "my-work-process-paragrafo2": "Design and Prototyping: I develop an initial prototype, ensuring that the design and functionality are in line with the client's expectations.",
  "my-work-process-paragrafo3": "Development and Testing: I build the project with a focus on clean, modular and efficient code. I run tests to ensure that everything works as expected..",
  "my-work-process-paragrafo4": "Delivery and Support: I deploy the application and offer ongoing support to keep the website updated, secure and optimized.",
  "why-choose-me": "Why Choose Me?",
  "why-choose-me-paragrafo1": "Transparent communication and commitment to deadlines.",
  "why-choose-me-paragrafo2": "Responsive Design and User Experience (UX).",
  "why-choose-me-paragrafo3": "Complete Front-End and Back-End Development.",
  "why-choose-me-paragrafo4": "Use of Modern Technologies.",
  "why-choose-me-paragrafo5": "Focus on Performance and SEO.",
  "why-choose-me-paragrafo6": "Security and Maintenance.",
  "main-section-paragrafo1": "As a Full-Stack Developer, I offer complete solutions for web application development, covering both the front-end and the back-end. My approach is geared towards creating robust, scalable systems with an excellent user experience. My services include:",
  "hidden-content-list-item1": "Front-End Development: Creating modern, responsive interfaces using frameworks such as React, Angular or Vue.js. Focus on usability, performance and intuitive design",
  "hidden-content-list-item2": "Back-End Development: Building secure and scalable APIs, integrating with databases (SQL and NoSQL) and configuring servers using Node.js, Django, Express, among others.",
  "hidden-content-list-item3": "Integration of Services and APIs: Connecting applications to third-party APIs, payment services, social authentication, email services, among others.",
  "hidden-content-list-item4": "DevOps and Deployment: Configuring CI/CD pipelines, deploying to cloud servers (AWS, Azure, DigitalOcean), as well as monitoring and maintaining applications.",
  "hidden-content-list-item5": "Database: Creating and optimizing relational (MySQL, PostgreSQL) and non-relational (MongoDB, Firebase) databases.",
  "main-technologies-list-items1": "Front-End: HTML, CSS, JavaScript, React, Angular, Vue.js.",
  "main-technologies-list-items2": "Back-End: Node.js, Express, Django, Flask.",
  "main-technologies-list-items3": "Database: MySQL, PostgreSQL, MongoDB.",
  "main-technologies-list-items4": "DevOps: Docker, Kubernetes, Git, CI/CD.",
  "main-technologies-list-items5": "Cloud Services: AWS, Azure, DigitalOcean.",
  "my-work-process-list-items1": "Project Understanding: I gather the client's requirements and needs to propose the best technological solution.",
  "my-work-process-list-items2": "Design and Prototyping: I develop a functional prototype to ensure that the solution meets expectations.",
  "my-work-process-list-items3": "Development and Testing: I build the code in a modular way and carry out tests to ensure the quality of the software.",
  "my-work-process-list-items4": "Deployment and Support: I deploy the application in a secure environment and offer ongoing support for improvements and updates.",
  "why-choose-me-list-items1": "Transparent communication during all stages of the project.",
  "why-choose-me-list-items2": "Delivery within agreed deadlines.",
  "why-choose-me-list-items3": "Modern, up-to-date technological solutions.",
  "why-choose-me-list-items4": "Complete support, from planning to maintenance.",
  "mobile-development": "Mobile Development",
  "mobile-development-what-do-i-do-list-items1": "Native Application Development: Creating apps for Android and iOS using native technologies, ensuring better performance and taking advantage of the specific features of each platform.",
  "mobile-development-what-do-i-do-list-items2": "Hybrid Application Development: Building multiplatform applications with frameworks such as React Native and Flutter, allowing the same code to work on Android and iOS devices, optimizing development time and costs.",
  "mobile-development-what-do-i-do-list-items3": "Modern Interface Design (UI/UX): Development of attractive and intuitive user interfaces, focused on usability and user experience (UX), ensuring that the application is easy to use and visually pleasing.",
  "mobile-development-what-do-i-do-list-items4": "Integration of APIs and Services: Integration of applications with external services, such as REST APIs, authentication services, cloud storage, payment gateways and push notifications.",
  "mobile-development-what-do-i-do-list-items5": "Application maintenance and updates: I offer ongoing support for maintenance, bug fixes and the implementation of new features, keeping your application up-to-date and secure at all times.",
  "mobile-development-main-technologies-list-items1": "Languages: Java, Kotlin, Swift, Dart, JavaScript.",
  "mobile-development-main-technologies-list-items2": "Frameworks: Flutter, React Native.",
  "mobile-development-main-technologies-list-items3": "Back-End for Mobile: Node.js, Firebase, Django.",
  "mobile-development-main-technologies-list-items4": "Database: SQLite, Firebase Firestore, MongoDB, PostgreSQL.",
  "mobile-development-main-technologies-list-items5": "Tools: Git, GitHub, Firebase, AWS, Google Cloud.",
  "mobile-development-main-technologies-list-items6": "Publishing: Google Play Store, Apple App Store.",
  "mobile-development-my-work-process-list-items1": "Project Discovery: I understand the client's needs, the target audience and the desired functionalities for the app.",
  "mobile-development-my-work-process-list-items2": "Prototyping and Design: I develop prototypes and wireframes to ensure that the app's interface is in line with the client's expectations.",
  "mobile-development-my-work-process-list-items3": "Development and Testing: I create the application using good programming practices, ensuring performance, security and stability. I carry out tests on different devices to ensure the best possible experience.",
  "moblie-development-my-work-process-list-items4": "Publishing and Support: I help publish the app in the stores (Google Play Store and Apple App Store) and offer ongoing support for improvements and updates.",
  "mobile-development-why-choose-me-list-items1": "Focus on performance and user experience.",
  "mobile-development-why-choose-me-list-items2": "Agile development and on-time delivery.",
  "mobile-development-why-choose-me-list-items3": "Scalable and secure solutions.",
  "mobile-development-why-choose-me-list-items4": "Ongoing support and constant improvement.",
  "software-engineer": "Software Engineer",
  "intro-software-engineer": "I'm Diogo. I'm a software engineer with a passion for developing innovative solutions that solve complex problems and improve the user experience. Professional specialized in the development, implementation, maintenance and optimization of software systems. He applies engineering principles to design, build, test and manage software that meets user needs and technical requirements.",
  "software-development": "Software Development",
  "software-development-list-items1": "Requirements Analysis: Understands the needs of customers or end users and translates these needs into functional and technical requirements.",
  "software-development-list-items2": "Software Architecture: Defines the overall structure of the software system, including the choice of technologies, standards and frameworks to be used.",
  "software-development-list-items3": "Programming: Writing the software code, developing functionalities and implementing the system's logic. This can involve the use of various programming languages, such as Python, Java, C#, JavaScript, among others.",
  "testing-and-quality-assurance": "Testing and Quality Assurance",
  "testing-and-quality-assurance-list-items1": "Software Testing: Creates and executes tests to ensure that the software works correctly and without Software Testing: Creates and executes tests to ensure that the software works correctly and without errors. This can include unit tests, integration tests, system tests and user acceptance tests.",
  "testing-and-quality-assurance-list-items2": "Debugging: Identifies and corrects errors or flaws in the software, also known as bugs, using debugging and analysis tools.",
  "maintenance-and-continous-improvement": "Maintenance and Continuous Improvement",
  "maintenance-and-continous-improvement-list-items1": "Project Planning: Estimates the time and resources needed to complete the software project.",
  "maintenance-and-continous-improvement-list-items2": "Team Collaboration: Works as part of a team with other software engineers, designers, product managers, and other professionals. Participates in meetings to discuss progress and solve problems.",
  "maintenance-and-continous-improvement-list-items3": "Documentation: Maintains clear and accurate documentation of code and processes to ensure that other team members can easily understand and continue the work.",
  "project-management": "Project Management",
  "project-management-list-items1": "Project Planning: Estimates the time and resources needed to complete the software project.",
  "project-management-list-items2": "Team Collaboration: Works as part of a team with other software engineers, designers, product managers, and other professionals. Participates in meetings to discuss progress and solve problems.",
  "project-management-list-items3": "Documentation: Maintains clear and accurate documentation of code and processes to ensure that other team members can easily understand and continue the work.",
  "scalability-and-performance": "Scalability and Performance",
  "scalability-and-performance-list-items1": "Performance: Works to optimize the software's performance, ensuring that it is fast and efficient, especially in systems that handle large volumes of data or simultaneous users.",
  "scalability-and-performance-list-items2": "Scalability: Ensures that the software system can be easily scaled to serve a larger number of users or data without compromising performance.",
  "software-security": "Software Security",
  "software-security-list-items": "Security: Implements practices and techniques to protect software against cyber attacks, such as SQL injection, XSS (cross-site scripting), and other security threats. This includes data encryption and authentication and authorization practices.",
  "systems-integration": "Systems Integration",
  "systems-integration-list-items": "Integration with other platforms: Software engineers often need to ensure that software integrates correctly with other external tools or systems (APIs, databases, other services).",
  "about-me-main-technologies-list-items1": "Programming Languages: In-depth knowledge of one or more programming languages (Java, Python, C#, JavaScript, etc.).", 
  "about-me-main-technologies-list-items2": "Version Control Systems: Familiarity with tools such as Git for managing and versioning code.",
  "about-me-main-technologies-list-items3": "Database: Understanding of relational (MySQL, PostgreSQL) and non-relational (MongoDB, Firebase) databases.",
  "about-me-main-technologies-list-items4": "Development methodologies: Knowledge of methodologies such as Agile, Scrum or DevOps.",
  "about-me-main-technologies-list-items5": "Problem-solving: Ability to find creative and efficient solutions to complex technical problems.",
  "about-me-main-technologies-list-items6": "Communication: Ability to communicate ideas and solutions clearly to team members and stakeholders.",
  "about-me-my-work-process-list-items1": "Implementing small features.",
  "about-me-my-work-process-list-items2": "Fixing simple bugs.",
  "about-me-my-work-process-list-items3": "Participation in code reviews",
  "about-me-my-work-process-list-items4": "Collaborating on automated tests.",
  "about-me-my-work-process-list-items5": "Reading and understanding legacy code.",
  "about-me-my-work-process-list-items6": "Performing deploys in development or staging environments.",
  "about-me-why-choose-me-paragraph": "The software engineer plays an essential role in almost any company or organization that develops or uses software. Their work ranges from designing and building technological solutions to maintaining complex systems and ensuring that the software is secure, efficient and meets users' needs. They combine advanced technical skills with problem-solving and team collaboration skills."
}
