{
  "portfolio-title": "Portfólio",
  "home": "Início",
  "services": "Serviços",
  "portfolio": "Portfólio",
  "contact": "Contato",
  "about": "Sobre",
  "name-introduction": "Olá, eu sou",
  "CV-button": "Baixar CV",
  "My-services": "Meus Serviços",
  "Web-Development": "Desenvolvimento Web",
  "Full-Stack-Development": "Desenvolvimento Full-Stack",
  "Mobile-Development": "Desenvolvimento Mobile",
  "texto-paragrafo1": "Como desenvolvedor web, ofereço soluções completas e personalizadas para atender às suas necessidades on-line, desde a criação de sites institucionais até sistemas complexos. Combinando habilidades em design, programação e otimização, sempre busco oferecer produtos funcionais e responsivos com uma ótima experiência para o usuário.",
  "texto-paragrafo2": "Como Desenvolvedor Full-Stack, ofereço soluções completas para o desenvolvimento de aplicações web, abrangendo tanto o front-end quanto o back-end. Minha abordagem é voltada para a criação de sistemas robustos, escaláveis e com uma excelente experiência do usuário.",
  "texto-paragrafo3": "Como Desenvolvedor Mobile, crio aplicativos nativos e híbridos que oferecem uma experiência fluida, intuitiva e de alto desempenho. Meu objetivo é transformar ideias em aplicativos funcionais, garantindo que o produto final seja escalável, seguro e atenda às necessidades dos usuários.",
  "latest-projects": "Últimos Projetos",
  "Dev-burguer": "Dev; 👨‍💻 Burguer 🍔",
  "texto-paragrafo4": "Site para uma hamburgueria.",
  "landing-page-barberdev": "Landing Page - BarberDev; ✂️",
  "texto-paragrafo6": "Landing page responsiva completa para o site BarberDev.",
  "dieta-AIapp": "❤️ Dieta.AI app 📲",
  "texto-paragrafo7": "Aplicativo móvel para rastreamento de dieta e nutrição.",
  "finans-website": "Site Finans 🪙",
  "texto-paragrafo8": "Site para uma empresa de finanças.",
  "spotify-clone": "Clone do Spotify 🎵",
  "texto-paragrafo9": "Clone do serviço de streaming de música Spotify.",
  "mario": "O Super Mario 🍄 Bros. Filme - Site",
  "texto-paragrafo10": "Site para o filme Super Mario Bros.",
  "national-museum": "Museu Nacional 🏛️",
  "texto-paragrafo11": "Site para o Museu Nacional.",
  "chale-hotel": "Chalé Hotel 🏨",
  "texto-paragrafo12": "Site para um chalé hotel.",
  "read-more-btn": "Leia Mais",
  "contact-me": "Entre em contato",
  "send-message": "Enviar Mensagem",
  "about-me": "Sobre Mim",
  "texto-paragrafo-contact-section": "Olá, eu sou o Diogo. Engenheiro de software, apaixonado por desenvolver soluções inovadoras que resolvam problemas complexos e aprimorem a experiência do usuário. Tenho sólidos conhecimentos em desenvolvimento de software, com foco em:",
  "footer": "Direitos autorais 2025 por </Diogo Ataide Silva>. Todos os direitos reservados.",
  "texto-paragrafo-web-development": "Como desenvolvedor web, ofereço soluções completas e personalizadas para atender às suas necessidades on-line, desde a criação de sites institucionais até sistemas complexos. Combinando habilidades em design, programação e otimização, sempre busco oferecer produtos funcionais e responsivos com uma ótima experiência para o usuário. Meus serviços incluem:",
  "what-do-i-do": "O que eu faço?",
  "what-do-i-do-paragrafo1": "Desenvolvimento de Sites e Blogs: Criação de sites modernos, funcionais e fáceis de navegar, com foco em design responsivo e otimização para diferentes dispositivos.",
  "what-do-i-do-paragrafo2": "Desenvolvimento de E-commerce: Implementação de lojas virtuais completas, com integração de sistemas de pagamento, gestão de estoque e personalização de layout.",
  "what-do-i-do-paragrafo3": "Aplicações Web Personalizadas: Desenvolvimento de sistemas sob medida, como plataformas, CRMs ou soluções internas, com funcionalidades específicas para o seu negócio.",
  "what-do-i-do-paragrafo4": "Desenvolvimento Front-End: Construção de interfaces interativas e intuitivas usando HTML, CSS, JavaScript e frameworks modernos, garantindo uma experiência de usuário envolvente.",
  "what-do-i-do-paragrafo5": "Desenvolvimento Back-End: Implementação de servidores, APIs e bancos de dados, garantindo segurança, escalabilidade e bom desempenho em suas aplicações.",
  "what-do-i-do-paragrafo6": "Consultoria em Desenvolvimento Web: Consultoria técnica sobre a melhor abordagem para o seu projeto web, incluindo escolha de tecnologias e melhores práticas.",
  "what-do-i-do-paragrafo7": "SEO e Otimização de Performance: Melhorar a visibilidade do seu site nos mecanismos de busca e otimização de velocidade para garantir melhor desempenho e experiência do usuário.",
  "what-do-i-do-paragrafo8": "Manutenção e Suporte Técnico: Atualizações regulares, correção de bugs, ajustes de segurança e monitoramento de desempenho."
  
  
}
