{
  "portfolio-title": "Portfólio",
  "home": "Início",
  "services": "Serviços",
  "portfolio": "Portfólio",
  "contact": "Contato",
  "about": "Sobre",
  "name-introduction": "Olá, eu sou",
  "CV-button": "Baixar CV",
  "My-services": "Meus Serviços",
  "Web-Development": "Desenvolvimento Web",
  "Full-Stack-Development": "Desenvolvimento Full-Stack",
  "Mobile-Development": "Desenvolvimento Mobile",
  "texto-paragrafo1": "Como desenvolvedor web, ofereço soluções completas e personalizadas para atender às suas necessidades on-line, desde a criação de sites institucionais até sistemas complexos. Combinando habilidades em design, programação e otimização, sempre busco oferecer produtos funcionais e responsivos com uma ótima experiência para o usuário.",
  "texto-paragrafo2": "Como Desenvolvedor Full-Stack, ofereço soluções completas para o desenvolvimento de aplicações web, abrangendo tanto o front-end quanto o back-end. Minha abordagem é voltada para a criação de sistemas robustos, escaláveis e com uma excelente experiência do usuário.",
  "texto-paragrafo3": "Como Desenvolvedor Mobile, crio aplicativos nativos e híbridos que oferecem uma experiência fluida, intuitiva e de alto desempenho. Meu objetivo é transformar ideias em aplicativos funcionais, garantindo que o produto final seja escalável, seguro e atenda às necessidades dos usuários.",
  "latest-projects": "Últimos Projetos",
  "Dev-burguer": "Dev; 👨‍💻 Burguer 🍔",
  "texto-paragrafo4": "Site para uma hamburgueria.",
  "landing-page-barberdev": "Landing Page - BarberDev; ✂️",
  "texto-paragrafo6": "Landing page responsiva completa para o site BarberDev.",
  "dieta-AIapp": "❤️ Dieta.AI app 📲",
  "texto-paragrafo7": "Aplicativo móvel para rastreamento de dieta e nutrição.",
  "finans-website": "Site Finans 🪙",
  "texto-paragrafo8": "Site para uma empresa de finanças.",
  "spotify-clone": "Clone do Spotify 🎵",
  "texto-paragrafo9": "Clone do serviço de streaming de música Spotify.",
  "mario": "O Super Mario 🍄 Bros. Filme - Site",
  "texto-paragrafo10": "Site para o filme Super Mario Bros.",
  "national-museum": "Museu Nacional 🏛️",
  "texto-paragrafo11": "Site para o Museu Nacional.",
  "chale-hotel": "Chalé Hotel 🏨",
  "texto-paragrafo12": "Site para um chalé hotel.",
  "read-more-btn": "Leia Mais",
  "contact-me": "Entre em contato",
  "send-message": "Enviar Mensagem",
  "about-me": "Sobre Mim",
  "texto-paragrafo-contact-section": "Olá, eu sou o Diogo. Engenheiro de software, apaixonado por desenvolver soluções inovadoras que resolvam problemas complexos e aprimorem a experiência do usuário. Tenho sólidos conhecimentos em desenvolvimento de software, com foco em:",
  "footer": "Direitos autorais 2025 por </Diogo Ataide Silva>. Todos os direitos reservados.",
  "texto-paragrafo-web-development": "Como desenvolvedor web, ofereço soluções completas e personalizadas para atender às suas necessidades on-line, desde a criação de sites institucionais até sistemas complexos. Combinando habilidades em design, programação e otimização, sempre busco oferecer produtos funcionais e responsivos com uma ótima experiência para o usuário. Meus serviços incluem:",
  "what-do-i-do": "O que eu faço?",
  "what-do-i-do-paragrafo1": "Desenvolvimento de Sites e Blogs: Criação de sites modernos, funcionais e fáceis de navegar, com foco em design responsivo e otimização para diferentes dispositivos.",
  "what-do-i-do-paragrafo2": "Desenvolvimento de E-commerce: Implementação de lojas virtuais completas, com integração de sistemas de pagamento, gestão de estoque e personalização de layout.",
  "what-do-i-do-paragrafo3": "Aplicações Web Personalizadas: Desenvolvimento de sistemas sob medida, como plataformas, CRMs ou soluções internas, com funcionalidades específicas para o seu negócio.",
  "what-do-i-do-paragrafo4": "Desenvolvimento Front-End: Construção de interfaces interativas e intuitivas usando HTML, CSS, JavaScript e frameworks modernos, garantindo uma experiência de usuário envolvente.",
  "what-do-i-do-paragrafo5": "Desenvolvimento Back-End: Implementação de servidores, APIs e bancos de dados, garantindo segurança, escalabilidade e bom desempenho em suas aplicações.",
  "what-do-i-do-paragrafo6": "Consultoria em Desenvolvimento Web: Consultoria técnica sobre a melhor abordagem para o seu projeto web, incluindo escolha de tecnologias e melhores práticas.",
  "what-do-i-do-paragrafo7": "SEO e Otimização de Performance: Melhorar a visibilidade do seu site nos mecanismos de busca e otimização de velocidade para garantir melhor desempenho e experiência do usuário.",
  "what-do-i-do-paragrafo8": "Manutenção e Suporte Técnico: Atualizações regulares, correção de bugs, ajustes de segurança e monitoramento de desempenho.",
  "main-technologies": "Principais Tecnologias",
  "main-technologies-paragrafo1": "Front-end: HTML5, CSS3, JavaScript (ES6+), React, Bootstrap, Tailwind.",
  "main-technologies-paragrafo2": "Back-end: Node.js, Express.js, MySQL, MongoDB, Firebase, AWS.",
  "main-technologies-paragrafo3": "Banco de Dados: MySQL, PostgreSQL, MongoDB.",
  "main-technologies-paragrafo4": "Controle de Versão: Git, GitHub.",
  "main-technologies-paragrafo5": "Implantação e Cloud: AWS, Netlify, Vercel, DigitalOcean.",
  "my-work-process": "Meu Processo de Trabalho",
  "my-work-process-paragrafo1": "Descoberta do Projeto: Entendo as necessidades do cliente, os objetivos do projeto e o público-alvo para definir uma estratégia personalizada.",
  "my-work-process-paragrafo2": "Design e Prototipagem: Desenvolvo um protótipo inicial, garantindo que o design e a funcionalidade estejam alinhados com as expectativas do cliente.",
  "my-work-process-paragrafo3": "Desenvolvimento e Testes: Construo o projeto com foco em código limpo, modular e eficiente. Realizo testes para garantir que tudo funcione conforme o esperado.",
  "my-work-process-paragrafo4": "Entrega e Suporte: Implanto a aplicação e ofereço suporte contínuo para manter o site atualizado, seguro e otimizado.",
  "why-choose-me": "Por que me escolher?",
  "why-choose-me-paragrafo1": "Comunicação transparente e compromisso com os prazos.",
  "why-choose-me-paragrafo2": "Design responsivo e experiência do usuário (UX).",
  "why-choose-me-paragrafo3": "Desenvolvimento completo de front-end e back-end.",
  "why-choose-me-paragrafo4": "Uso de tecnologias modernas.",
  "why-choose-me-paragrafo5": "Foco em desempenho e SEO.",
  "why-choose-me-paragrafo6": "Segurança e manutenção.",
  "main-section-paragrafo1": "Como Desenvolvedor Full-Stack, ofereço soluções completas para o desenvolvimento de aplicações web, abrangendo tanto o front-end quanto o back-end. Minha abordagem é voltada para a criação de sistemas robustos, escaláveis e com uma excelente experiência do usuário. Meus serviços incluem:",
  "hidden-content-list-item1": "Desenvolvimento de front-end: Criação de interfaces modernas e responsivas usando estruturas como React, Angular ou Vue.js. Foco em usabilidade, desempenho e design intuitivo.",
  "hidden-content-list-item2": "Desenvolvimento de back-end: Criação de APIs seguras e escaláveis, integração com bancos de dados (SQL e NoSQL) e configuração de servidores usando Node.js, Django, Express, entre outros.",
  "hidden-content-list-item3": "Integração de serviços e APIs: Conexão de aplicativos a APIs de terceiros, serviços de pagamento, autenticação social, serviços de e-mail, entre outros.  ",
  "hidden-content-list-item4": "DevOps e implantação: Configuração de pipelines de CI/CD, implantação em servidores em nuvem (AWS, Azure, DigitalOcean), bem como monitoramento e manutenção de aplicativos.",
  "hidden-content-list-item5": "Banco de dados: Criação e otimização de bancos de dados relacionais (MySQL, PostgreSQL) e não relacionais (MongoDB, Firebase).",
  "main-technologies-list-items1": "Front-end: HTML, CSS, JavaScript, React, Angular, Vue.js.",
  "main-technologies-list-items2": "Back-end: Node.js, Express.js, Django, Flask.",
  "main-technologies-list-items3": "Banco de Dados: MySQL, PostgreSQL, MongoDB.",
  "main-technologies-list-items4": "Controle de Versão: Git, GitHub.",
  "main-technologies-list-items5": "Implantação e Cloud: AWS, Azure, DigitalOcean.",
  "my-work-process-list-items1": "Compreensão do projeto: Reúno os requisitos e as necessidades do cliente para propor a melhor solução tecnológica.",
  "my-work-process-list-items2": "Design e prototipagem: Desenvolvo um protótipo funcional para garantir que a solução atenda às expectativas.",
  "my-work-process-list-items3": "Desenvolvimento e testes: Desenvolvo o código de forma modular e realizo testes para garantir a qualidade do software.",
  "my-work-process-list-items4": "Implantação e suporte: Implemento o aplicativo em um ambiente seguro e ofereço suporte contínuo para melhorias e atualizações.",
  "why-choose-me-list-items1": "Comunicação transparente em todas as etapas do projeto.",
  "why-choose-me-list-items2": "Entrega dentro dos prazos acordados.",
  "why-choose-me-list-items3": "Soluções tecnológicas modernas e atualizadas.",
  "why-choose-me-list-items4": "Suporte completo, desde o planejamento até a manutenção.",
  "mobile-development": "Desenvolvimento Mobile",
  "mobile-development-what-do-i-do-list-items1": "Desenvolvimento de aplicativos nativos: Criação de aplicativos para Android e iOS usando tecnologias nativas, garantindo melhor desempenho e aproveitando os recursos específicos de cada plataforma.",
  "mobile-development-what-do-i-do-list-items2": "Desenvolvimento de aplicativos híbridos: Criação de aplicativos multiplataforma com frameworks como React Native e Flutter, permitindo que o mesmo código funcione em dispositivos Android e iOS, otimizando o tempo e os custos de desenvolvimento.",
  "mobile-development-what-do-i-do-list-items3": "Design moderno de interface (UI/UX): Desenvolvimento de interfaces de usuário atraentes e intuitivas, com foco na usabilidade e na experiência do usuário (UX), garantindo que o aplicativo seja fácil de usar e visualmente agradável.",
  "mobile-development-what-do-i-do-list-items4": "Integração de APIs e serviços: Integração de aplicativos com serviços externos, como APIs REST, serviços de autenticação, armazenamento em nuvem, gateways de pagamento e notificações push.",
  "mobile-development-what-do-i-do-list-items5": "Manutenção e atualizações de aplicativos: Ofereço suporte contínuo para manutenção, correções de bugs e implementação de novos recursos, mantendo seu aplicativo sempre atualizado e seguro.",
  "mobile-development-main-technologies-list-items1": "Linguagens: Java, Kotlin, Swift, Dart, JavaScript.",
  "mobile-development-main-technologies-list-items2": "Estruturas: Flutter, React Native.",
  "mobile-development-main-technologies-list-items3": "Back-end para dispositivos móveis: Node.js, Firebase, Django.",
  "mobile-development-main-technologies-list-items4": "Banco de dados: SQLite, Firebase Firestore, MongoDB, PostgreSQL.",
  "mobile-development-main-technologies-list-items5": "Ferramentas: Git, GitHub, Firebase, AWS, Google Cloud.",
  "mobile-development-main-technologies-list-items6": "Publicação: Google Play Store, Apple App Store.",
  "mobile-development-my-work-process-list-items1": "Descoberta do projeto: Entendo as necessidades do cliente, o público-alvo e as funcionalidades desejadas para o aplicativo.",
  "mobile-development-my-work-process-list-items2": "Prototipagem e design: Desenvolvo protótipos e wireframes para garantir que a interface do aplicativo esteja de acordo com as expectativas do cliente.",
  "mobile-development-my-work-process-list-items3": "Desenvolvimento e teste: Crio o aplicativo usando boas práticas de programação, garantindo o desempenho, a segurança e a estabilidade. Realizo testes em diferentes dispositivos para garantir a melhor experiência possível.",
  "moblie-development-my-work-process-list-items4": "Publicação e suporte: Ajudo a publicar o aplicativo nas lojas (Google Play Store e Apple App Store) e ofereço suporte contínuo para melhorias e atualizações."
}
